#include <iostream>
#include <string>

using namespace std;


int main2() {

	/*-------------------------------------------------------------------------------------------
	* 整型变量表示的是整数类型的数据
	* 超出取值范围会变为负数
	* sizeof()函数可以得到数据类型所占用的内存空间 参数可以是类型本身也可以是变量
	*/

	//短整型 short
	short num1 = 10;
	cout << "short占用的内存空间为：" << sizeof(num1) << endl;
	//整型 int 
	cout << "int占用的内存空间为：" << sizeof(int) << endl;
	//长整型 long
	cout << "long占用的内存空间为：" << sizeof(long) << endl;
	//长长整型 long long
	cout << "long long占用的内存空间为：" << sizeof(long long) << endl;

	/*-------------------------------------------------------------------------------------------
	* 实型（浮点型）
	* 默认情况下，输出一个小数，会显示出6位有效数字
	 */
	 // 1、单精度 float   (7位有效数字)
	float f1 = 3.145926f;  //末尾加f表示按单精度处理 不然就默认为double类型转换才能到float
	// 2、双精度  double  （15-16位有效数字）
	double f2 = 3.1415926;
	cout << "f1 = " << f1 << endl;
	cout << "f2 =" << f2 << endl;
	//科学计数法
	float f3 = 3e2;  //3 *  10^2
	float f4 = 3e-2; //3 *  0.1^2 

	cout << "float 占用内存空间为:" << sizeof(float) << endl;
	cout << "double 占用内存空间为:" << sizeof(double) << endl;

	/**-------------------------------------------------------------------------------------------
	* 字符型
	* 字符型变量用于显示单个字符 语法 char ch = 'a';字符型变量只占用一个字节
	* 字符型变量在存储的时候并不是把字符存入到内存中，而是将字符对应的ASCII编码存储到内存中
	*/

	char  ch = 'a';
	cout << "ch = " << ch << endl;
	cout << "char占用内存空间为：" << sizeof(char) << endl;

	//字符型变量常见错误
	//char ch = "a"; //1、创建字符型变量要用单引号 这里面用的双引号包含的变量就会报错
	//char ch = 'abcd' //2、创建字符串变量的时候 单引号里面只能有一个字符

	//字符串变量对应的ASCII编码
	cout << "使用int（）函数获取字符ASCII编码 a = " << int(ch) << endl;

	/**-------------------------------------------------------------------------------------------
	* 转义字符
	* 用来表示一些不能显示出来的ASCII码
	* 我们常用的转义字符有 ：\n \\ \t
	*/

	//换行符 \n
	cout << "hello \nworld" << endl;
	//反斜杠
	cout << "hello \"world" << endl;
	//水平制表符 \t (用途，在输出黑窗口的时候可以对齐 有8个位置)
	cout << "hello \tworld" << endl;



	/**-------------------------------------------------------------------------------------------
	* 字符串型
	* 用来表示一串字符串
	*/
	//1、C风格的创建方式 用char创建 变量名后面要加[],变量值要用双引号包括
	char str[] = "hello world";
	cout << "str = " << str << endl;
	//2、C++风格 用string创建，不过使用的时候要在头部引入 
	string str2 = "hello world";
	cout << "str2 = " << str2 << endl;



	/**-------------------------------------------------------------------------------------------
	* 布尔型 
	* 创建方式 bool + 变量名 = 变量值（true/false）
	* 布尔数据类型代表真或者假的值
	* bool类型只有两个值
	* true  --真（本质是1 ，只要是非0的数字也都可以看作true ）
	* false  -- 假 （本质是0）
	*/

	bool flag = true;
	cout << "flag =" << flag << endl;
	cout << "bool所占的内存空间：" << sizeof(flag) << endl;



	/**-------------------------------------------------------------------------------------------
	* 数据输入
	* -------------------------------------------------------------------------------------------
	* 用于从键盘获取数据
	* 关键字cin
	* 语法 cin >> 变量
	*/

	int  i = 0;
	cout << "请重新赋予i值：" << endl;
	cin >> i;
	cout << "i = " << i << endl;


	system("pause");
	return 0;
}